sppr_my/src/Catalogs/ЗанятияКурса/ЗанятияКурса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЗанятияКурса</name>
  <owners>Catalog.Курсы</owners>
  <tabularSections>
    <name>КомментарииИФайлы</name>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаФайл</name>
      <type>
        <types>CatalogRef.ЗанятияКурсаФайлы</types>
      </type>
    </attributes>
    <attributes>
      <name>Заголовок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Якоря</name>
  </tabularSections>
</mdclass:Catalog>

sppr_my/src/Catalogs/ЗанятияКурса/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	НоваяСтрока = Объект.КомментарииИФайлы.Добавить();
	НоваяСтрока.Комментарий 	= ВыбранноеЗначение.Комментарий;
	НоваяСтрока.СсылкаНаФайл 	= ВыбранноеЗначение.Файл;
	
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ДобавитьКомментарий(Команда)
	
	ОткрытьФорму("Справочник.ЗанятияКурса.Форма.ФормаКомментария", , ЭтотОбъект, КлючУникальности,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти
